## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 32 to add, 14 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                       NAME                                        |
|----------|-----------------------------------------------------------------------------------|
| add      | `aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day`         |
|          | `aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day`         |
|          | `aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day`     |
|          | `aws_cloudwatch_event_target.run_nagware_lambda_every_day`                        |
|          | `aws_cloudwatch_log_group.archive_form_templates`                                 |
|          | `aws_cloudwatch_log_group.audit_logs`                                             |
|          | `aws_cloudwatch_log_group.dead_letter_queue_consumer`                             |
|          | `aws_cloudwatch_log_group.response_archiver`                                      |
|          | `aws_cloudwatch_log_group.vault_integrity`                                        |
|          | `aws_lambda_code_signing_config.lambda_code_signing_config[0]`                    |
|          | `aws_lambda_event_source_mapping.audit_logs`                                      |
|          | `aws_lambda_event_source_mapping.vault_updated_item_stream`                       |
|          | `aws_lambda_function.audit_logs`                                                  |
|          | `aws_lambda_function.form_archiver`                                               |
|          | `aws_lambda_function.reliability_dlq_consumer`                                    |
|          | `aws_lambda_function.response_archiver`                                           |
|          | `aws_lambda_function.vault_integrity`                                             |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_archive_form_responses_lambda`     |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_dead_letter_queue_consumer_lambda` |
|          | `aws_lambda_permission.allow_cloudwatch_to_run_form_archiver_lambda`              |
|          | `aws_s3_object.audit_logs_code`                                                   |
|          | `aws_s3_object.form_archiver_code`                                                |
|          | `aws_s3_object.nagware_code`                                                      |
|          | `aws_s3_object.reliability_code`                                                  |
|          | `aws_s3_object.reliability_dlq_consumer_code`                                     |
|          | `aws_s3_object.response_archiver_code`                                            |
|          | `aws_s3_object.submission_code`                                                   |
|          | `aws_s3_object.vault_integrity_code`                                              |
|          | `aws_signer_signing_job.vault_integrity[0]`                                       |
|          | `aws_signer_signing_profile.lambda_signing_profile[0]`                            |
| update   | `aws_cloudwatch_event_rule.cron_2am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_3am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_4am_every_day`                                    |
|          | `aws_cloudwatch_event_rule.cron_5am_every_business_day`                           |
|          | `aws_cloudwatch_log_group.nagware`                                                |
|          | `aws_cloudwatch_log_group.reliability`                                            |
|          | `aws_cloudwatch_log_group.submission`                                             |
|          | `aws_iam_policy.lambda_dynamodb`                                                  |
|          | `aws_iam_policy.lambda_rds`                                                       |
|          | `aws_iam_policy.lambda_s3`                                                        |
|          | `aws_iam_policy.lambda_secrets`                                                   |
|          | `aws_lambda_function.nagware`                                                     |
|          | `aws_lambda_function.reliability`                                                 |
|          | `aws_lambda_function.submission`                                                  |
| recreate | `aws_lambda_permission.allow_cloudwatch_to_run_nagware_lambda`                    |
|          | `aws_lambda_permission.submission`                                                |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/7655596679).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.cron_2am_every_day will be updated in-place
  # (imported from "every-day-at-2am")
  ~ resource "aws_cloudwatch_event_rule" "cron_2am_every_day" {
        arn                 = "arn:aws:events:ca-central-1:957818836222:rule/every-day-at-2am"
        description         = "Fires every day at 2am EST"
        event_bus_name      = "default"
        id                  = "every-day-at-2am"
        is_enabled          = true
        name                = "every-day-at-2am"
        schedule_expression = "cron(0 7 * * ? *)"
        state               = "ENABLED"
        tags                = {}
      ~ tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.cron_3am_every_day will be updated in-place
  # (imported from "every-day-at-3am")
  ~ resource "aws_cloudwatch_event_rule" "cron_3am_every_day" {
        arn                 = "arn:aws:events:ca-central-1:957818836222:rule/every-day-at-3am"
        description         = "Fires every day at 3am EST"
        event_bus_name      = "default"
        id                  = "every-day-at-3am"
        is_enabled          = true
        name                = "every-day-at-3am"
        schedule_expression = "cron(0 8 * * ? *)"
        state               = "ENABLED"
        tags                = {}
      ~ tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.cron_4am_every_day will be updated in-place
  # (imported from "every-day-at-4am")
  ~ resource "aws_cloudwatch_event_rule" "cron_4am_every_day" {
        arn                 = "arn:aws:events:ca-central-1:957818836222:rule/every-day-at-4am"
        description         = "Fires every day at 4am EST"
        event_bus_name      = "default"
        id                  = "every-day-at-4am"
        is_enabled          = true
        name                = "every-day-at-4am"
        schedule_expression = "cron(0 9 * * ? *)"
        state               = "ENABLED"
        tags                = {}
      ~ tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.cron_5am_every_business_day will be updated in-place
  # (imported from "every-business-day-at-5am")
  ~ resource "aws_cloudwatch_event_rule" "cron_5am_every_business_day" {
        arn                 = "arn:aws:events:ca-central-1:957818836222:rule/every-business-day-at-5am"
        description         = "Fires every business day at 5am EST"
        event_bus_name      = "default"
        id                  = "every-business-day-at-5am"
        is_enabled          = true
        name                = "every-business-day-at-5am"
        schedule_expression = "cron(0 10 ? * MON-FRI *)"
        state               = "ENABLED"
        tags                = {}
      ~ tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.run_archive_form_responses_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_responses_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-3am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_archive_form_templates_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_archive_form_templates_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-4am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_dead_letter_queue_consumer_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_dead_letter_queue_consumer_lambda_every_day" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-day-at-2am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.run_nagware_lambda_every_day will be created
  + resource "aws_cloudwatch_event_target" "run_nagware_lambda_every_day" {
      + arn            = "arn:aws:lambda:ca-central-1:957818836222:function:Nagware"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "every-business-day-at-5am"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.archive_form_templates will be created
  + resource "aws_cloudwatch_log_group" "archive_form_templates" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Archive_Form_Templates"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.audit_logs will be created
  + resource "aws_cloudwatch_log_group" "audit_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Audit_Logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.dead_letter_queue_consumer will be created
  + resource "aws_cloudwatch_log_group" "dead_letter_queue_consumer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Reliability_DLQ_Consumer"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.nagware will be updated in-place
  # (imported from "/aws/lambda/Nagware")
  ~ resource "aws_cloudwatch_log_group" "nagware" {
        arn               = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/lambda/Nagware"
        id                = "/aws/lambda/Nagware"
        kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
        log_group_class   = "STANDARD"
        name              = "/aws/lambda/Nagware"
      ~ retention_in_days = 90 -> 731
        skip_destroy      = false
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.reliability will be updated in-place
  # (imported from "/aws/lambda/Reliability")
  ~ resource "aws_cloudwatch_log_group" "reliability" {
        arn               = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/lambda/Reliability"
        id                = "/aws/lambda/Reliability"
        kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
        log_group_class   = "STANDARD"
        name              = "/aws/lambda/Reliability"
      ~ retention_in_days = 90 -> 731
        skip_destroy      = false
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.response_archiver will be created
  + resource "aws_cloudwatch_log_group" "response_archiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Response_Archiver"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.submission will be updated in-place
  # (imported from "/aws/lambda/Submission")
  ~ resource "aws_cloudwatch_log_group" "submission" {
        arn               = "arn:aws:logs:ca-central-1:957818836222:log-group:/aws/lambda/Submission"
        id                = "/aws/lambda/Submission"
        kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
        log_group_class   = "STANDARD"
        name              = "/aws/lambda/Submission"
      ~ retention_in_days = 90 -> 731
        skip_destroy      = false
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.vault_integrity will be created
  + resource "aws_cloudwatch_log_group" "vault_integrity" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Vault_Data_Integrity_Check"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_dynamodb will be updated in-place
  # (imported from "arn:aws:iam::957818836222:policy/lambda_dynamobdb")
  ~ resource "aws_iam_policy" "lambda_dynamodb" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_dynamobdb"
        description = "IAM policy for storing Form responses in DynamoDB"
        id          = "arn:aws:iam::957818836222:policy/lambda_dynamobdb"
        name        = "lambda_dynamobdb"
        path        = "/"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:Scan",
                            "dynamodb:Query",
                            "dynamodb:PutItem",
                          + "dynamodb:ListStreams",
                            "dynamodb:GetShardIterator",
                            "dynamodb:GetRecords",
                            "dynamodb:GetItem",
                            "dynamodb:DescribeStream",
                            "dynamodb:DeleteItem",
                            "dynamodb:BatchWriteItem",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault/index/*",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/Vault",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/ReliabilityQueue",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs/index/*",
                            "arn:aws:dynamodb:ca-central-1:957818836222:table/AuditLogs",
                          + "arn:aws:dynamodb:ca-central-1:123456789012:table/Vault/stream/2023-03-14T15:54:31.086",
                        ]
                      - Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7JI63YIBQ7"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_kms will be imported
    resource "aws_iam_policy" "lambda_kms" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_kms"
        description = "IAM policy for storing encrypting and decrypting data"
        id          = "arn:aws:iam::957818836222:policy/lambda_kms"
        name        = "lambda_kms"
        path        = "/"
        policy      = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "kms:GenerateDataKey",
                            "kms:Encrypt",
                            "kms:Decrypt",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d",
                            "arn:aws:kms:ca-central-1:957818836222:key/afbaea67-8277-4a4c-853e-7697dd2dade5",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7DAMVNIVMU"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_logging will be imported
    resource "aws_iam_policy" "lambda_logging" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_logging"
        description = "IAM policy for logging from a lambda"
        id          = "arn:aws:iam::957818836222:policy/lambda_logging"
        name        = "lambda_logging"
        path        = "/"
        policy      = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "logs:CreateLogGroup",
                            "logs:CreateLogStream",
                            "logs:PutLogEvents",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:*:*:*"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7DLPNBNMP7"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_rds will be updated in-place
  # (imported from "arn:aws:iam::957818836222:policy/lambda_rds")
  ~ resource "aws_iam_policy" "lambda_rds" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_rds"
        description = "IAM policy for allowing acces to DB"
        id          = "arn:aws:iam::957818836222:policy/lambda_rds"
        name        = "lambda_rds"
        path        = "/"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "dbqms:CreateFavoriteQuery",
                          - "dbqms:DescribeFavoriteQueries",
                          + "tag:GetResources",
                          + "secretsmanager:CreateSecret",
                          + "rds-data:RollbackTransaction",
                          + "rds-data:ExecuteStatement",
                          + "rds-data:ExecuteSql",
                          + "rds-data:CommitTransaction",
                          + "rds-data:BeginTransaction",
                          + "rds-data:BatchExecuteStatement",
                          + "dbqms:UpdateQueryHistory",
                            "dbqms:UpdateFavoriteQuery",
                          - "dbqms:DeleteFavoriteQueries",
                            "dbqms:GetQueryString",
                          - "dbqms:CreateQueryHistory",
                            "dbqms:DescribeQueryHistory",
                          - "dbqms:UpdateQueryHistory",
                          + "dbqms:DescribeFavoriteQueries",
                            "dbqms:DeleteQueryHistory",
                          - "rds-data:ExecuteSql",
                          - "rds-data:ExecuteStatement",
                          - "rds-data:BatchExecuteStatement",
                          - "rds-data:BeginTransaction",
                          - "rds-data:CommitTransaction",
                          - "rds-data:RollbackTransaction",
                          - "secretsmanager:CreateSecret",
                          - "secretsmanager:ListSecrets",
                          - "secretsmanager:GetRandomPassword",
                          - "tag:GetResources",
                          + "dbqms:DeleteFavoriteQueries",
                          + "dbqms:CreateQueryHistory",
                          + "dbqms:CreateFavoriteQuery",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = "RDSDataServiceAccess"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7KRZUNWE7S"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  # (imported from "arn:aws:iam::957818836222:policy/lambda_s3")
  ~ resource "aws_iam_policy" "lambda_s3" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_s3"
        description = "IAM policy for storing files in S3"
        id          = "arn:aws:iam::957818836222:policy/lambda_s3"
        name        = "lambda_s3"
        path        = "/"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action   = [
                            "s3:PutObject",
                            "s3:ListBucket",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                          + "arn:aws:s3:::forms-staging-lambda-code/*",
                          + "arn:aws:s3:::forms-staging-lambda-code",
                            "arn:aws:s3:::forms-production-vault-file-storage/*",
                            "arn:aws:s3:::forms-production-vault-file-storage",
                            "arn:aws:s3:::forms-production-reliability-file-storage/*",
                            "arn:aws:s3:::forms-production-reliability-file-storage",
                            "arn:aws:s3:::forms-production-archive-storage/*",
                            "arn:aws:s3:::forms-production-archive-storage",
                        ]
                      - Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7NCGZE6SVF"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_secrets will be updated in-place
  # (imported from "arn:aws:iam::957818836222:policy/lambda_secrets")
  ~ resource "aws_iam_policy" "lambda_secrets" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_secrets"
        description = "IAM policy for accessing secret manager"
        id          = "arn:aws:iam::957818836222:policy/lambda_secrets"
        name        = "lambda_secrets"
        path        = "/"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                        Action   = "secretsmanager:GetSecretValue"
                        Effect   = "Allow"
                      ~ Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:957818836222:secret:token_secret-jw4Dou",
                            "arn:aws:secretsmanager:ca-central-1:957818836222:secret:notify_api_key-sLtddr",
                            "arn:aws:secretsmanager:ca-central-1:957818836222:secret:database-secret-RThElE",
                        ]
                      - Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7ITUHDHSRG"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sns will be imported
    resource "aws_iam_policy" "lambda_sns" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_sns"
        description = "IAM policy for allowing lambda to publish message in SNS for Slack notification"
        id          = "arn:aws:iam::957818836222:policy/lambda_sns"
        name        = "lambda_sns"
        path        = "/"
        policy      = jsonencode(
            {
                Statement = [
                    {
                        Action   = "sns:Publish"
                        Effect   = "Allow"
                        Resource = "arn:aws:sns:ca-central-1:957818836222:alert-critical"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7GQDHURLJZ"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_sqs will be imported
    resource "aws_iam_policy" "lambda_sqs" {
        arn         = "arn:aws:iam::957818836222:policy/lambda_sqs"
        description = "IAM policy for sending messages through SQS"
        id          = "arn:aws:iam::957818836222:policy/lambda_sqs"
        name        = "lambda_sqs"
        path        = "/"
        policy      = jsonencode(
            {
                Statement = [
                    {
                        Action   = [
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage",
                            "sqs:DeleteMessage",
                            "sqs:GetQueueAttributes",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:*:*:*"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        policy_id   = "ANPA56ATTST7CRSZB3F5K"
        tags        = {}
        tags_all    = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
    }

  # aws_iam_role.lambda will be imported
    resource "aws_iam_role" "lambda" {
        arn                   = "arn:aws:iam::957818836222:role/iam_for_lambda"
        assume_role_policy    = jsonencode(
            {
                Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "lambda.amazonaws.com"
                        }
                        Sid       = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
        create_date           = "2021-03-04T19:25:30Z"
        force_detach_policies = false
        id                    = "iam_for_lambda"
        managed_policy_arns   = [
            "arn:aws:iam::957818836222:policy/lambda_dynamobdb",
            "arn:aws:iam::957818836222:policy/lambda_kms",
            "arn:aws:iam::957818836222:policy/lambda_logging",
            "arn:aws:iam::957818836222:policy/lambda_rds",
            "arn:aws:iam::957818836222:policy/lambda_s3",
            "arn:aws:iam::957818836222:policy/lambda_secrets",
            "arn:aws:iam::957818836222:policy/lambda_sns",
            "arn:aws:iam::957818836222:policy/lambda_sqs",
            "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole",
        ]
        max_session_duration  = 3600
        name                  = "iam_for_lambda"
        path                  = "/"
        tags                  = {}
        tags_all              = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        unique_id             = "AROA56ATTST7BVNHHGEZ3"
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be imported
    resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
        id         = "iam_for_lambda-arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
        policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_dynamodb will be imported
    resource "aws_iam_role_policy_attachment" "lambda_dynamodb" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_dynamobdb"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_dynamobdb"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_kms will be imported
    resource "aws_iam_role_policy_attachment" "lambda_kms" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_kms"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_kms"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_logs will be imported
    resource "aws_iam_role_policy_attachment" "lambda_logs" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_logging"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_logging"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_rds will be imported
    resource "aws_iam_role_policy_attachment" "lambda_rds" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_rds"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_rds"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_s3 will be imported
    resource "aws_iam_role_policy_attachment" "lambda_s3" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_s3"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_s3"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_secrets will be imported
    resource "aws_iam_role_policy_attachment" "lambda_secrets" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_secrets"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_secrets"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sns will be imported
    resource "aws_iam_role_policy_attachment" "lambda_sns" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_sns"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_sns"
        role       = "iam_for_lambda"
    }

  # aws_iam_role_policy_attachment.lambda_sqs will be imported
    resource "aws_iam_role_policy_attachment" "lambda_sqs" {
        id         = "iam_for_lambda-arn:aws:iam::957818836222:policy/lambda_sqs"
        policy_arn = "arn:aws:iam::957818836222:policy/lambda_sqs"
        role       = "iam_for_lambda"
    }

  # aws_lambda_code_signing_config.lambda_code_signing_config[0] will be created
  + resource "aws_lambda_code_signing_config" "lambda_code_signing_config" {
      + arn           = (known after apply)
      + config_id     = (known after apply)
      + id            = (known after apply)
      + last_modified = (known after apply)

      + allowed_publishers {
          + signing_profile_version_arns = (known after apply)
        }

      + policies {
          + untrusted_artifact_on_deployment = "Enforce"
        }
    }

  # aws_lambda_event_source_mapping.audit_logs will be created
  + resource "aws_lambda_event_source_mapping" "audit_logs" {
      + batch_size                         = 10
      + enabled                            = true
      + event_source_arn                   = "arn:aws:sqs:ca-central-1:957818836222:audit_log_queue"
      + function_arn                       = (known after apply)
      + function_name                      = (known after apply)
      + function_response_types            = [
          + "ReportBatchItemFailures",
        ]
      + id                                 = (known after apply)
      + last_modified                      = (known after apply)
      + last_processing_result             = (known after apply)
      + maximum_batching_window_in_seconds = 30
      + maximum_record_age_in_seconds      = (known after apply)
      + maximum_retry_attempts             = (known after apply)
      + parallelization_factor             = (known after apply)
      + state                              = (known after apply)
      + state_transition_reason            = (known after apply)
      + uuid              ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.form_archiver"]
WARN -...
```

</details>
